Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/high_court.html.txt.tmx
Source language: en
Languages: ga

source: The maximum number of judges that can be appointed to the High Court is 37
ga: Ní féidir le níos mó ná 37 breitheamh a bheith ceaptha chun na hArd-Chúirte

source: This includes the President of the High Court
ga: Cuimsíonn sé seo Uachtarán na hArd-Chúirte

source: The President of the Circuit Court and the Chief Justice are also additional Judges of the High Court
ga: Is breithimh bhreise de chuid na hArd-Chúirte iad Uachtarán na Cúirte Cuarda agus an Príomhbhreitheamh

source: Normally the High Court sits in Dublin to hear original actions (i.e., cases that are not appeals from a lower court)
ga: De ghnáth, suíonn an Ard-Chúirt i mBaile Átha Cliath chun éisteacht le gníomhaíochtaí bunaidh (m.sh., cásanna nach achomhairc iad ó chúirt níos ísle)

source: It also sits in Cork and Galway four times each year; Limerick three times each year; Waterford, Sligo and Dundalk twice each year and Kilkenny and Ennis once a year to hear original actions
ga: Suíonn sí i gCorcaigh agus i nGaillimh faoi cheathair gach bliain; faoi thrí i Luimneach gach bliain; faoi dhó i bPort Láirge, i Sligeach agus i nDún Dealgan agus uair amháin in aghaidh na bliana i gCill Chainnigh agus in Inis chun éisteach le gníomhaíochtaí bunaidh

source: The High Court hears appeals from the Circuit Court, in civil and family law matters, twice a year at the following venues outside Dublin - Carlow, Carrick-on-Shannon, Cavan, Castlebar, Clonmel, Cork, Dundalk, Ennis, Galway, Kilkenny, Letterkenny, Limerick, Longford, Monaghan, Mullingar, Naas, Nenagh, Portlaoise, Roscommon, Sligo, Tullamore, Tralee, Trim, Waterford, Wexford and Wicklow
ga: Éisteann an Ard-Chúirt le achomhairc ón gCúirt Chuarda, i cúinsí dlí shibhialta agus theaghlaigh, faoi dhó in aghaidh na bliana ag na háiteanna seo a leanas taobh amuigh de Bhaile Átha Cliath – Ceatharlach, Cora Droma Rúisc, Cabhán, Caisleán an Bharraigh, Cluain Meala, Corcaigh, Dún Dealgan, Inis, Gaillimh, Cill Chainnigh, Leitir Ceannainn, Luimneach, Longfort, Muineachán, An Mhuileann gCearr, Port Laoise, Ros Comáin, Sligeach, Tulach Mór, Trá Lí, Baile Átha Troim, Loch Garman agus Cill Mhantáin

source: Matters coming before the High Court are normally heard and determined by one judge but the President of the High Court may direct that any case may be heard by three judges in what is known as a divisional court
ga: Éisteann breitheamh amháin le agus cinneann sé/sí ar chúinsí a thagann os comhair na hArd-Chúirte ach d'fhéadfadh Uachtarán na hArd-Chúirte a rá gur féidir le triúr breitheamh éisteacht le cás i rud ar a nglaoitear cúirt deighilte

source: The High Court is not a court of local or limited jurisdiction
ga: Ní cúirt áitiúil nó le húdarás srianta í an Ard-Chúirt

source: Bunreacht na hEireann (the Irish Constitution) states that the High Court has full original jurisdiction in and power to determine all matters and questions, whether of law or fact, civil or criminal
ga: Deir Bunreacht na hEireann (the Irish Constitution) go bhfuil údarás iomláin, bunaidh ag an Ard-Chúirt agus an chumhacht le gach cúinse agus gach ceist a chinneadh, bíodh sé dlíthiúil nó firiciúil, sibhialta nó coiriúil

source: This means that there is no limit or restriction either as to where proceedings should be commenced or how much money can be awarded by the High Court in compensation or damages
ga: Ciallaíonn sé seo nach bhfuil srian nó críoch ar bith maidir leis an áit inar cheart tús a chur le himeachtaí nó cé mhéad airgead gur féidir leis an Ard-Chúirt a bhronnadh mar chúiteamh nó mar dhamáistí

source: In certain civil cases, such as defamation, assault and false imprisonment, a judge will sit with a jury in the High Court
ga: I gcásanna sibhialta áirithe, cosúil le clúmhilleadh, le hionsaí agus le príosúnú neamhdhleathach, suífidh breitheamh le giúiré san Ard-Chúirt

source: In all cases, a majority vote of nine of the twelve jurors is sufficient to determine the verdict
ga: I ngach cás, is fiú vóta tromlaigh de naonúr den dáréag ghiúróir chun an fíorasc a chinneadh

source: • The High Court is the appropriate court to hear cases involving claims for damages in excess of €75,000 (personal injury €60,000)
ga: • Is í an Ard-Chúirt an chúirt chuí chun éisteacht le cásanna lena bhfuil éilimh ar dhamáistí níos mó ná €75,000 i gceist (díobhála pearsanta €60,000)

source: • The High Court can hear questions relating to the validity of a law
ga: • Is féidir leis an Ard-Chúirt éisteacht le ceisteanna maidir le bailíocht dlí

source: • The High Court acts as an appeal court from the Circuit Court in civil matters
ga: • Feidhmíonn an Ard-Chúirt mar chúirt achomhairc ón gCúirt Chuarda i gcúinsí sibhialta

source: • The High Court has power to review the decisions of all inferior courts by judicial review
ga: • Tá an chumhacht ag an Ard-Chúirt athbhreithniú a dhéanamh ar chinntí de gach cúirt atá níos ísle ná í trí athbhreithniú breithiúnach

source: • The High Court may give rulings on a question of law submitted by the District Court and may hear appeals in certain other circumstances provided by statute, i.e., in regard to decisions of the District Court on applications for bail
ga: • D’fhéadfadh an Ard-Chúirt rialú a thabhairt ar cheist dlí curtha isteach ag an gCúirt Dúiche agus is féidir léi éisteacht le achomhairc i gcásanna ar leith eile soláthraithe ag an reacht m.sh., maidir le cinntí na Cúirte Dúiche ar iarratais ar bhannú

source: • The High Court can review decisions of certain Tribunals of Inquiry
ga: • Is féidir leis an Ard-Chúirt athbhreithniú a dhéanamh ar chinntí a dhéanann Binsí Fiosrúcháin ar leith

source: • The High Court can review certain decisions made by public bodies including, for example, those on environmental matters
ga: • Is féidir leis an Ard-Chúirt athbhreithniú a dhéanamh ar chinntí déanta ag eagraíochtaí poiblí lena n-áirítear, mar shampla, iad siad ar chúinsí comhshaoil

source: When the High Court is hearing criminal matters it is known as the Central Criminal Court
ga: Nuair atá an Ard-Chúirt ag éisteacht le cúinsí coiriúla glaoitear an Phríomh-Chúirt Choiriúil uirthi

source: In criminal matters, the High Court Judge sits with a jury of twelve
ga: I gcásanna coiriúla, suíonn Breitheamh na hArd-Chúirte le giúiré de dháréag

source: However, a verdict need not be unanimous in a case where there are at least eleven jurors if ten of them agree on a verdict after a reasonable time has passed (not less than two hours)
ga: Ach, ní gá go mbeadh fíorasc comhaontach i gcás nach bhfuil níos lú ná aon ghiúróir déag má aontaíonn deichniúr acu ar fhíorasc tar éis dóibh machnamh a dhéanamh ar feadh tréimhse réasúnta (ní féidir leis an tréimhse a bheith níos lú ná dhá uair an chloig)

source: A person refused bail in the District Court can apply to the High Court for bail
ga: Is féidir le duine nach bhfuair bannú sa Chúirt Dúiche iarratas a dhéanamh chun na hArd-Chúirte ar bhannú

source: A person granted bail in the District Court can apply to the High Court to vary the conditions of bail
ga: Is féidir le duine a bhfuair bannú sa Chúirt Dúiche iarratas a dhéanamh chun na hArd-Chúirte chun coinníollacha bannaithe a athrú

source: A person charged with murder can only apply to the High Court for bail
ga: Ní féidir le duine cúisithe i ndúnmharú ach iarratas a dhéanamh chun na hArd-Chúirte ar bhannú
